In [ ]:
print ("Hello World")

In [ ]:
a=10
name="Namra"

In [ ]:
my_list = [1, 2, 3]
print(my_list)

In [ ]:
my_list[1] = 50  # Change element at index 1
print(my_list)

In [ ]:
my_list.append(6)

In [ ]:
print(my_list)

In [ ]:

my_list.pop(1)      # Removes the element at index 1
print(my_list)

In [ ]:
#if we want to remove element 3 so we use same index
my_list.pop(1)      # Removes the element at index 1
print(my_list)

In [ ]:
my_tuple = (1, 2, 3)

print(my_tuple)

### Assignment Task:

- Create a list of names of 5 German desserts

-  Now replace the name of dessert at index 2

- After that add name of your favourite dessert at the end of list

-  At last, delete the name of least favourite dessert from already created list

## Equations and Operator Precedence

- Try to manually find out the answer of this equation using PEDMAS "x = 17 / 2 % 2 * 3**3"

- Copy paste the equation in cell below and verify your answer

- Try to manually find out the answer of this equation using PEDMAS y= 17/2 * 3**3 %2
- Copy paste the equation in cell below and verify your answer

 
- Try to manually find out the answer of this equation using PEDMAS z= 17/2 * 3**3 %2
- Copy paste the equation in cell below and verify your answer

In [4]:
Names=['Alice', 'Bob', 'Charlie']
Age=[25, 30, 35]
City =['New York', 'Los Angeles', 'Chicago']

In [5]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie','Dave','Sara','Liza'],
    'Age': [25, 30, 35,20,40,18],
    'City': ['New York', 'Los Angeles', 'Chicago','Maryland','Misouri','Arizona']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3     Dave   20     Maryland
4     Sara   40      Misouri
5     Liza   18      Arizona

In [10]:
df.shape[0]

6

In [9]:
df.shape[1]

3

In [11]:
df.shape

(6, 3)

In [14]:
df.loc[:,:]

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3     Dave   20     Maryland
4     Sara   40      Misouri
5     Liza   18      Arizona

In [15]:
df.loc[3:4,:]

   Name  Age      City
3  Dave   20  Maryland
4  Sara   40   Misouri

In [17]:
df.loc[:,["City"]]

          City
0     New York
1  Los Angeles
2      Chicago
3     Maryland
4      Misouri
5      Arizona

In [19]:
df.loc[[0,2],:]

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [18]:
df.loc[df.Age>20,:]

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
4     Sara   40      Misouri

### Create a Dataframe Yourself

- create a dataframe yourself using following employee data having employee name, salary , and profession

In [8]:
area=["Sawsan", 'Sara', 'John',"Victoria"]
salary=[2500, 3000, 2000,5000]
profession =['Designer', 'MarketingExpert', 'SoftwareEngineer','DataScientist']

- after creating dataframe, print length of number of rows in dataframe Hint: use shape

- print data of only 0 column and all rows

- print data of only 1 and 4 rows and all columns

-  print data of only 2 and 3 rows and profession column

- print data of all employees having salary greater than 2000